backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 80, 64, 3]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Sequential
    config:
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        batch_input_shape: !!python/tuple [null, 80, 64, 3]
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: &id001 !!python/tuple [1, 1]
        dtype: float32
        filters: 16
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu, trainable: true}
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 16
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_1
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_1, trainable: true}
    - class_name: MaxPooling2D
      config:
        data_format: channels_last
        dtype: float32
        name: max_pooling2d
        padding: valid
        pool_size: !!python/tuple [2, 2]
        strides: !!python/tuple [2, 2]
        trainable: true
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 32
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_2
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_2, trainable: true}
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 32
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_3
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_3, trainable: true}
    - class_name: MaxPooling2D
      config:
        data_format: channels_last
        dtype: float32
        name: max_pooling2d_1
        padding: valid
        pool_size: !!python/tuple [2, 2]
        strides: !!python/tuple [2, 2]
        trainable: true
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_4
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_4, trainable: true}
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_5
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_5, trainable: true}
    - class_name: MaxPooling2D
      config:
        data_format: channels_last
        dtype: float32
        name: max_pooling2d_2
        padding: valid
        pool_size: !!python/tuple [2, 2]
        strides: !!python/tuple [2, 2]
        trainable: true
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 128
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_6
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_6, trainable: true}
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {dtype: float32}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 128
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
            seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_7
        padding: same
        strides: !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: LeakyReLU
      config: {alpha: 0.20000000298023224, dtype: float32, name: leaky_re_lu_7, trainable: true}
    - class_name: Flatten
      config: {data_format: channels_last, dtype: float32, name: flatten, trainable: true}
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: sequential
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - sequential
        - 1
        - 0
        - {}
    name: dense
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - sequential
        - 1
        - 0
        - {}
    name: dense_1
  name: model
  output_layers:
  - [dense, 0, 0]
  - [dense_1, 0, 0]
keras_version: 2.1.6-tf
